# Задание 1.
# Поработайте с переменными, создайте несколько,
# выведите на экран, запросите у пользователя несколько чисел и
# строк и сохраните в переменные, выведите на экран.
#
# name = input('Ввведите ваше имя: ')
# password = input('Введите ваш пароль: ')
# age = input('Введите ваш возраст: ')
# print(f"Ваши данные для входа в аккаунт: имя - {name}, пароль - {password}, возраст - {age}")

# Задание 2.
# Пользователь вводит время в секундах.
# Переведите время в часы, минуты и секунды и выведите в формате чч:мм:сс.
#
# time_sec = int(input('Введите число: '))
# hours = time_sec//3600
# minutes = time_sec//60
# print(f'Время: {hours}:{minutes}:{time_sec}')

# Задание 3.
# Узнайте у пользователя целое положительное число n.
# Найдите сумму чисел n + nn + nnn.
#
# n = input('Введите число: ')
# nn = int(n+n)
# nnn = int(n+n+n)
# n = int(n)
# result = n+nn+nnn
# print(result)

# Задание 4.
# rev = int(input('Введите выручку фирмы: '))
# costs = int(input('Введите издержки фирмы: '))
# if rev > costs:
#     profit = rev - costs
#     print(f'Финансовый результат - прибыль. Ее величина: {profit}')
#     rent = profit / rev
#     print(f'Рентабельность: {rent}')
#     staff = int(input('Введите количество сотрудников: '))
#     profit_staff = float(profit / staff)
#     print(f'Прибыль фирмы в расчете на одного сотрудника: {profit_staff}')
# else:
#     print('Фирма работает в убыток')
