# Задача 2: Найдите сумму цифр трехзначного числа.
#
# n = int(input('Введите трехзначное число: '))
# result = n//100 + n//10%10 + n%10
# print(result)

# Задача 4:
# s = int(input('Введите количество сделанных журавликов: '))
# print('Петя и Сережа сделали по', s//6, 'шт')
# print('Маша сделала ', s//6*4, 'шт')

# Задача 6:
# n = input('Введите шестизначных номер билета: ')
# n1 = int(n[0])+int(n[1])+int(n[2])
# n2 = int(n[3])+int(n[4])+int(n[5])
# if n1 == n2:
#     print('Yes')
# else:
#     print('No')

# Задача 8:
# n = int(input('Введите длину первой стороны: '))
# m = int(input('Введите длину второй стороны: '))
# k = int(input('Введите количество долек: '))
# if k % n == 0 or k % m == 0:
#     print('Yes')
# else:
#     print('No')
